In [1]:
# main file for Project 2- ETL
# KJ, Britt, Jonathan, Stacey

In [2]:
import pandas as pd
from sqlalchemy import create_engine
import datetime as dt

# Extract Data

In [3]:
# Bring in data sets
features_data_set = "Resources/Features data set.csv"
sales_data_set = "Resources/sales data-set.csv"
stores_data_set = "Resources/stores data-set.csv"
bitcoin_data_set = "Resources/Bitcoin Historical Data.csv"
games_data = "Resources/games.csv"
teams_data = "Resources/teams.csv"
#link unofficial holiday csv
unoff_holiday_ds = "Resources/unofficial_holiday.csv"

# Transform Data

### Games Dataframe

In [4]:
# read csv to create DataFrames
games_df = pd.read_csv(games_data)
teams_df = pd.read_csv(teams_data)

# drop unnecessary columns from teams_df: LEAGUE_ID, MIN_YEAR, MAX_YEAR, ABBREVIATION, YEARFOUNDED, ARENA, ARENACAPACITY
    # OWNER GENERALMANAGER, HEADCOACH, DLEAGUEAFFILIATION
teams_df.drop(columns=['LEAGUE_ID', 'MIN_YEAR', 'MAX_YEAR', 'ABBREVIATION', 'YEARFOUNDED', 'ARENA', 'ARENACAPACITY',
                       'OWNER', 'GENERALMANAGER', 'HEADCOACH', 'DLEAGUEAFFILIATION'], inplace=True)
teams_df.head()

      TEAM_ID   NICKNAME         CITY
0  1610612737      Hawks      Atlanta
1  1610612738    Celtics       Boston
2  1610612740   Pelicans  New Orleans
3  1610612741      Bulls      Chicago
4  1610612742  Mavericks       Dallas

In [5]:
# turn nickname and city into one column 
teams_df['TEAM_NAME'] = teams_df['CITY'].str.cat(teams_df['NICKNAME'], sep=' ')
# drop nickname and city
teams_df.drop(columns=['NICKNAME', 'CITY'], inplace=True)
teams_df

       TEAM_ID               TEAM_NAME
0   1610612737           Atlanta Hawks
1   1610612738          Boston Celtics
2   1610612740    New Orleans Pelicans
3   1610612741           Chicago Bulls
4   1610612742        Dallas Mavericks
5   1610612743          Denver Nuggets
6   1610612745         Houston Rockets
7   1610612746    Los Angeles Clippers
8   1610612747      Los Angeles Lakers
9   1610612748              Miami Heat
10  1610612749         Milwaukee Bucks
11  1610612750  Minnesota Timberwolves
12  1610612751           Brooklyn Nets
13  1610612752         New York Knicks
14  1610612753           Orlando Magic
15  1610612754          Indiana Pacers
16  1610612755      Philadelphia 76ers
17  1610612756            Phoenix Suns
18  1610612757  Portland Trail Blazers
19  1610612758        Sacramento Kings
20  1610612759       San Antonio Spurs
21  1610612760   Oklahoma City Thunder
22  1610612761         Toronto Raptors
23  1610612762               Utah Jazz
24  1610612763       Memphis Grizzlies
25  1610612764      Washington Wizards
26  1610612765         Detroit Pistons
27  1610612766       Charlotte Hornets
28  1610612739     Cleveland Cavaliers
29  1610612744   Golden State Warriors

In [6]:
# clean games df
# drop unnecessary columns
games_df.drop(columns=["GAME_STATUS_TEXT", "SEASON", "TEAM_ID_home", "PTS_home", "FG_PCT_home", "FT_PCT_home", "FG3_PCT_home", "AST_home", "REB_home", "TEAM_ID_away", "PTS_away", "FG_PCT_away", "FT_PCT_away", "FG3_PCT_away", "AST_away", "REB_away", "HOME_TEAM_WINS"], inplace=True)
games_df.head()

  GAME_DATE_EST   GAME_ID  HOME_TEAM_ID  VISITOR_TEAM_ID
0    2021-05-26  42000102    1610612755       1610612764
1    2021-05-26  42000132    1610612752       1610612737
2    2021-05-26  42000142    1610612762       1610612763
3    2021-05-25  42000112    1610612751       1610612738
4    2021-05-25  42000152    1610612756       1610612747

In [7]:
# merge team ids from teams_df into games_df--- HOME
games_teams_df = games_df.merge(teams_df,how='inner', left_on='HOME_TEAM_ID',right_on='TEAM_ID')
games_teams_df.rename(columns={"TEAM_NAME":"HOME_TEAM_NAME"},inplace=True)

# merge team ids from teams_df into games_df--- HOME
games_teams_df = games_teams_df.merge(teams_df,how='inner', left_on='VISITOR_TEAM_ID',right_on='TEAM_ID')
games_teams_df.rename(columns={"TEAM_NAME":"VISITOR_TEAM_NAME"},inplace=True)

In [8]:
# drop unnecessary columns from final dataframe
games_teams_df.drop(columns=["TEAM_ID_x", "TEAM_ID_y"], inplace=True)
# reorder columns
games_teams_df = games_teams_df[["GAME_DATE_EST","GAME_ID", "HOME_TEAM_ID", "HOME_TEAM_NAME", "VISITOR_TEAM_ID", "VISITOR_TEAM_NAME"]]

In [9]:
# rename columns to match SQL schema
games_teams_df.rename(columns={"GAME_DATE_EST":"date", "GAME_ID":"game_id", "HOME_TEAM_ID":"home_team_id","HOME_TEAM_NAME":"home_team_name","VISITOR_TEAM_ID":"visitor_team_id","VISITOR_TEAM_NAME":"visitor_team_name"}, inplace=True)

In [10]:
# convert date column from str to datetime object
games_teams_df.date = pd.to_datetime(games_teams_df.date)

# grab data only in 2011
games_teams_df = games_teams_df[games_teams_df["date"].dt.year==2011]

# reset index
games_teams_df.reset_index()

,index,date,game_id,home_team_id,home_team_name,visitor_team_id,visitor_team_name
0,11,2011-12-20,11100015,1610612755,Philadelphia 76ers,1610612764,Washington Wizards
1,12,2011-02-23,21000850,1610612755,Philadelphia 76ers,1610612764,Washington Wizards
2,13,2011-01-05,21000515,1610612755,Philadelphia 76ers,1610612764,Washington Wizards
3,50,2011-01-24,21000657,1610612752,New York Knicks,1610612764,Washington Wizards
4,84,2011-03-28,21001100,1610612762,Utah Jazz,1610612764,Washington Wizards
...,...,...,...,...,...,...,...
910,24572,2011-04-18,41000112,1610612748,Miami Heat,1610612755,Philadelphia 76ers
911,24573,2011-04-16,41000111,1610612748,Miami Heat,1610612755,Philadelphia 76ers
912,24574,2011-03-25,21001072,1610612748,Miami Heat,1610612755,Philadelphia 76ers
913,24613,2011-02-27,21000881,1610612739,Cleveland Cavaliers,1610612755,Philadelphia 76ers
914,24648,2011-01-19,21000615,1610612753,Orlando Magic,1610612755,Philadelphia 76ers

In [11]:
games_teams_df.head()

,date,game_id,home_team_id,home_team_name,visitor_team_id,visitor_team_name
11,2011-12-20,11100015,1610612755,Philadelphia 76ers,1610612764,Washington Wizards
12,2011-02-23,21000850,1610612755,Philadelphia 76ers,1610612764,Washington Wizards
13,2011-01-05,21000515,1610612755,Philadelphia 76ers,1610612764,Washington Wizards
50,2011-01-24,21000657,1610612752,New York Knicks,1610612764,Washington Wizards
84,2011-03-28,21001100,1610612762,Utah Jazz,1610612764,Washington Wizards

### Bitcoin DataFrame

In [12]:
# Create a dataframe
df_bitcoin_orig = pd.read_csv(bitcoin_data_set)
df_bitcoin_orig.head()

           Date  Price  Open  High  Low   Vol. Change %
0  Jan 01, 2011    0.3   0.3   0.3  0.3  2.82K    0.00%
1  Jan 02, 2011    0.3   0.3   0.3  0.3  5.35K    0.00%
2  Jan 03, 2011    0.3   0.3   0.3  0.3  1.43K    0.00%
3  Jan 04, 2011    0.3   0.3   0.3  0.3  1.88K    0.00%
4  Jan 05, 2011    0.3   0.3   0.3  0.3  0.36K    0.00%

In [13]:
# Format the date 
df_bitcoin_orig.Date = pd.to_datetime(df_bitcoin_orig.Date, format='%b %d, %Y', dayfirst=True)
df_bitcoin_orig.head()

        Date  Price  Open  High  Low   Vol. Change %
0 2011-01-01    0.3   0.3   0.3  0.3  2.82K    0.00%
1 2011-01-02    0.3   0.3   0.3  0.3  5.35K    0.00%
2 2011-01-03    0.3   0.3   0.3  0.3  1.43K    0.00%
3 2011-01-04    0.3   0.3   0.3  0.3  1.88K    0.00%
4 2011-01-05    0.3   0.3   0.3  0.3  0.36K    0.00%

In [14]:
# Drop unneeded columns
df_bitcoin = df_bitcoin_orig.drop(['Open', 'High', 'Low', 'Vol.', 'Change %'], axis=1)
df_bitcoin.head()

        Date  Price
0 2011-01-01    0.3
1 2011-01-02    0.3
2 2011-01-03    0.3
3 2011-01-04    0.3
4 2011-01-05    0.3

In [15]:
# Create rolling 7-day average
df_bitcoin['bitcoin_price'] = df_bitcoin.iloc[:,1].rolling(window=7).mean()
df_bitcoin.head(14)

         Date  Price  bitcoin_price
0  2011-01-01    0.3            NaN
1  2011-01-02    0.3            NaN
2  2011-01-03    0.3            NaN
3  2011-01-04    0.3            NaN
4  2011-01-05    0.3            NaN
5  2011-01-06    0.3            NaN
6  2011-01-07    0.3       0.300000
7  2011-01-08    0.3       0.300000
8  2011-01-09    0.3       0.300000
9  2011-01-10    0.3       0.300000
10 2011-01-11    0.3       0.300000
11 2011-01-12    0.3       0.300000
12 2011-01-13    0.3       0.300000
13 2011-01-14    0.4       0.314286

In [16]:
# Drop price column
df_bitcoin = df_bitcoin.drop(['Price'], axis=1)
df_bitcoin

          Date  bitcoin_price
0   2011-01-01            NaN
1   2011-01-02            NaN
2   2011-01-03            NaN
3   2011-01-04            NaN
4   2011-01-05            NaN
..         ...            ...
360 2011-12-27       4.000000
361 2011-12-28       4.042857
362 2011-12-29       4.085714
363 2011-12-30       4.128571
364 2011-12-31       4.242857

[365 rows x 2 columns]

### Features DataFrame

In [17]:
# Create a dataframe
df_features_orig = pd.read_csv(features_data_set)
df_features_orig.head()

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
0,1,05/02/2010,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
1,1,12/02/2010,38.51,2.548,NaN,NaN,NaN,NaN,NaN,211.242170,8.106,True
2,1,19/02/2010,39.93,2.514,NaN,NaN,NaN,NaN,NaN,211.289143,8.106,False
3,1,26/02/2010,46.63,2.561,NaN,NaN,NaN,NaN,NaN,211.319643,8.106,False
4,1,05/03/2010,46.50,2.625,NaN,NaN,NaN,NaN,NaN,211.350143,8.106,False

In [18]:
# Convert date column
df_features_orig.Date = pd.to_datetime(df_features_orig.Date, format='%d/%m/%Y', dayfirst=True)
df_features_orig.head()

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
0,1,2010-02-05,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
1,1,2010-02-12,38.51,2.548,NaN,NaN,NaN,NaN,NaN,211.242170,8.106,True
2,1,2010-02-19,39.93,2.514,NaN,NaN,NaN,NaN,NaN,211.289143,8.106,False
3,1,2010-02-26,46.63,2.561,NaN,NaN,NaN,NaN,NaN,211.319643,8.106,False
4,1,2010-03-05,46.50,2.625,NaN,NaN,NaN,NaN,NaN,211.350143,8.106,False

In [19]:
# Merge Bitcoin data for dates present in Features dataframes
df_features = df_features_orig.merge(df_bitcoin, how='inner', on='Date')
df_features
# Can see it added the bitcoin data for each date for each of the 45 stores

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday,bitcoin_price
0,1,2011-01-07,48.27,2.976,NaN,NaN,NaN,NaN,NaN,211.404742,7.742,False,0.300000
1,2,2011-01-07,44.69,2.976,NaN,NaN,NaN,NaN,NaN,211.064888,8.028,False,0.300000
2,3,2011-01-07,53.35,2.976,NaN,NaN,NaN,NaN,NaN,214.695510,7.551,False,0.300000
3,4,2011-01-07,39.34,2.980,NaN,NaN,NaN,NaN,NaN,127.191774,6.510,False,0.300000
4,5,2011-01-07,48.30,2.976,NaN,NaN,NaN,NaN,NaN,211.956031,6.634,False,0.300000
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2335,41,2011-12-30,34.12,3.119,5251.98,56106.20,134.70,1059.49,2366.54,196.358610,6.759,True,4.128571
2336,42,2011-12-30,48.92,3.428,242.41,1447.26,3.64,183.96,459.06,130.071032,7.874,True,4.128571
2337,43,2011-12-30,41.83,3.129,415.59,1926.05,NaN,50.66,837.74,211.074055,10.148,True,4.128571
2338,44,2011-12-30,31.53,3.119,409.92,1566.42,NaN,17.64,153.90,130.071032,6.078,True,4.128571
2339,45,2011-12-30,37.79,3.389,3604.35,43941.56,287.45,357.43,750.01,189.062016,8.523,True,4.128571

In [20]:
# Delete columns, rename columns, convert f to c for a new column?
# Could also create a column for which week of the year it is based on the date?

In [21]:
df_features = df_features.drop(columns=['MarkDown1','MarkDown2','MarkDown3', 'MarkDown4','MarkDown5'])
df_features

,Store,Date,Temperature,Fuel_Price,CPI,Unemployment,IsHoliday,bitcoin_price
0,1,2011-01-07,48.27,2.976,211.404742,7.742,False,0.300000
1,2,2011-01-07,44.69,2.976,211.064888,8.028,False,0.300000
2,3,2011-01-07,53.35,2.976,214.695510,7.551,False,0.300000
3,4,2011-01-07,39.34,2.980,127.191774,6.510,False,0.300000
4,5,2011-01-07,48.30,2.976,211.956031,6.634,False,0.300000
...,...,...,...,...,...,...,...,...
2335,41,2011-12-30,34.12,3.119,196.358610,6.759,True,4.128571
2336,42,2011-12-30,48.92,3.428,130.071032,7.874,True,4.128571
2337,43,2011-12-30,41.83,3.129,211.074055,10.148,True,4.128571
2338,44,2011-12-30,31.53,3.119,130.071032,6.078,True,4.128571
2339,45,2011-12-30,37.79,3.389,189.062016,8.523,True,4.128571

In [27]:
df_features = df_features.rename(columns={'Store':'store_id','Date':'date', 'Temperature':'temperature_far','Fuel_Price':'fuel_price','CPI':'cpi','IsHoliday':'is_holiday','Unemployment':'unemployment'})
df_features

,store_id,date,temperature_far,fuel_price,cpi,unemployment,is_holiday,bitcoin_price
0,1,2011-01-07,48.27,2.976,211.404742,7.742,False,0.300000
1,2,2011-01-07,44.69,2.976,211.064888,8.028,False,0.300000
2,3,2011-01-07,53.35,2.976,214.695510,7.551,False,0.300000
3,4,2011-01-07,39.34,2.980,127.191774,6.510,False,0.300000
4,5,2011-01-07,48.30,2.976,211.956031,6.634,False,0.300000
...,...,...,...,...,...,...,...,...
2335,41,2011-12-30,34.12,3.119,196.358610,6.759,True,4.128571
2336,42,2011-12-30,48.92,3.428,130.071032,7.874,True,4.128571
2337,43,2011-12-30,41.83,3.129,211.074055,10.148,True,4.128571
2338,44,2011-12-30,31.53,3.119,130.071032,6.078,True,4.128571
2339,45,2011-12-30,37.79,3.389,189.062016,8.523,True,4.128571

In [28]:
#create week column with week of year
df_features['week'] = df_features['date'].dt.week
df_features

,store_id,date,temperature_far,fuel_price,cpi,unemployment,is_holiday,bitcoin_price,week
0,1,2011-01-07,48.27,2.976,211.404742,7.742,False,0.300000,1
1,2,2011-01-07,44.69,2.976,211.064888,8.028,False,0.300000,1
2,3,2011-01-07,53.35,2.976,214.695510,7.551,False,0.300000,1
3,4,2011-01-07,39.34,2.980,127.191774,6.510,False,0.300000,1
4,5,2011-01-07,48.30,2.976,211.956031,6.634,False,0.300000,1
...,...,...,...,...,...,...,...,...,...
2335,41,2011-12-30,34.12,3.119,196.358610,6.759,True,4.128571,52
2336,42,2011-12-30,48.92,3.428,130.071032,7.874,True,4.128571,52
2337,43,2011-12-30,41.83,3.129,211.074055,10.148,True,4.128571,52
2338,44,2011-12-30,31.53,3.119,130.071032,6.078,True,4.128571,52
2339,45,2011-12-30,37.79,3.389,189.062016,8.523,True,4.128571,52

In [29]:
#move week column to appropriate location
df_features = df_features[['store_id', 'date','week', 'temperature_far', 'fuel_price', 'cpi', 'unemployment', 'is_holiday', 'bitcoin_price']]
df_features

,store_id,date,week,temperature_far,fuel_price,cpi,unemployment,is_holiday,bitcoin_price
0,1,2011-01-07,1,48.27,2.976,211.404742,7.742,False,0.300000
1,2,2011-01-07,1,44.69,2.976,211.064888,8.028,False,0.300000
2,3,2011-01-07,1,53.35,2.976,214.695510,7.551,False,0.300000
3,4,2011-01-07,1,39.34,2.980,127.191774,6.510,False,0.300000
4,5,2011-01-07,1,48.30,2.976,211.956031,6.634,False,0.300000
...,...,...,...,...,...,...,...,...,...
2335,41,2011-12-30,52,34.12,3.119,196.358610,6.759,True,4.128571
2336,42,2011-12-30,52,48.92,3.428,130.071032,7.874,True,4.128571
2337,43,2011-12-30,52,41.83,3.129,211.074055,10.148,True,4.128571
2338,44,2011-12-30,52,31.53,3.119,130.071032,6.078,True,4.128571
2339,45,2011-12-30,52,37.79,3.389,189.062016,8.523,True,4.128571

In [30]:
#create new column and convert F to C
df_features['temperature_celsius'] = ((df_features['temperature_far'] - 32) / (9/5)).round(2)
df_features

/Users/staceydougherty/opt/anaconda3/envs/Virtual_Env/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

,store_id,date,week,temperature_far,fuel_price,cpi,unemployment,is_holiday,bitcoin_price,temperature_celsius
0,1,2011-01-07,1,48.27,2.976,211.404742,7.742,False,0.300000,9.04
1,2,2011-01-07,1,44.69,2.976,211.064888,8.028,False,0.300000,7.05
2,3,2011-01-07,1,53.35,2.976,214.695510,7.551,False,0.300000,11.86
3,4,2011-01-07,1,39.34,2.980,127.191774,6.510,False,0.300000,4.08
4,5,2011-01-07,1,48.30,2.976,211.956031,6.634,False,0.300000,9.06
...,...,...,...,...,...,...,...,...,...,...
2335,41,2011-12-30,52,34.12,3.119,196.358610,6.759,True,4.128571,1.18
2336,42,2011-12-30,52,48.92,3.428,130.071032,7.874,True,4.128571,9.40
2337,43,2011-12-30,52,41.83,3.129,211.074055,10.148,True,4.128571,5.46
2338,44,2011-12-30,52,31.53,3.119,130.071032,6.078,True,4.128571,-0.26
2339,45,2011-12-30,52,37.79,3.389,189.062016,8.523,True,4.128571,3.22

In [31]:
#reorder columns to move celsius column next to farenheit col, remove is_holiday
df_features = df_features[['store_id', 'date','week', 'temperature_far','temperature_celsius', 'fuel_price', 'cpi', 'unemployment', 'bitcoin_price']]
df_features

,store_id,date,week,temperature_far,temperature_celsius,fuel_price,cpi,unemployment,bitcoin_price
0,1,2011-01-07,1,48.27,9.04,2.976,211.404742,7.742,0.300000
1,2,2011-01-07,1,44.69,7.05,2.976,211.064888,8.028,0.300000
2,3,2011-01-07,1,53.35,11.86,2.976,214.695510,7.551,0.300000
3,4,2011-01-07,1,39.34,4.08,2.980,127.191774,6.510,0.300000
4,5,2011-01-07,1,48.30,9.06,2.976,211.956031,6.634,0.300000
...,...,...,...,...,...,...,...,...,...
2335,41,2011-12-30,52,34.12,1.18,3.119,196.358610,6.759,4.128571
2336,42,2011-12-30,52,48.92,9.40,3.428,130.071032,7.874,4.128571
2337,43,2011-12-30,52,41.83,5.46,3.129,211.074055,10.148,4.128571
2338,44,2011-12-30,52,31.53,-0.26,3.119,130.071032,6.078,4.128571
2339,45,2011-12-30,52,37.79,3.22,3.389,189.062016,8.523,4.128571

### Sales DataFrame

In [22]:
# Create a dataframe
df_sales = pd.read_csv(sales_data_set)
df_sales.head()

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  05/02/2010      24924.50      False
1      1     1  12/02/2010      46039.49       True
2      1     1  19/02/2010      41595.55      False
3      1     1  26/02/2010      19403.54      False
4      1     1  05/03/2010      21827.90      False

In [23]:
# Convert date column
df_sales.Date = pd.to_datetime(df_sales.Date, format='%d/%m/%Y', dayfirst=True)
df_sales.head()

   Store  Dept       Date  Weekly_Sales  IsHoliday
0      1     1 2010-02-05      24924.50      False
1      1     1 2010-02-12      46039.49       True
2      1     1 2010-02-19      41595.55      False
3      1     1 2010-02-26      19403.54      False
4      1     1 2010-03-05      21827.90      False

In [24]:
# add promotional/markdown to sales df as boolean (i.e., if a markdown exist == TRUE, if NAN == FALSE)

### Unnofficial holiday / Sales data

In [ ]:
#read unofficial holiday csv
holidays=pd.read_csv(unoff_holiday_ds)

In [ ]:
#add year to the end of the all values in day column
holidays['day'] = holidays['day']+' 2011'

In [ ]:
#take out row with no date
holidays1=holidays.loc[holidays["day"]!=" S.T.E.A.M. Day  2011"]
#found row with no day 
holidays1=holidays1.loc[holidays1["day"]!=" June 2011"]
#continued finding rows with no day
holidays1=holidays1.loc[holidays1["day"]!=" July 3 to 9 2011"]
holidays1=holidays1.loc[holidays1["day"]!=" July 22-30 2011"]
#dropped dates containing "-"
holidays1 = holidays1[holidays['day'].str.contains("-")==False]
#dropped na values from date
holidays1 = holidays1.dropna()
#dropped another row with no day date
holidays1=holidays1.loc[holidays1["day"]!=" July 2011"]

In [ ]:
#formatted day into datetime 
holidays1["day"]=pd.to_datetime(holidays1["day"])

In [ ]:
#created copy of row with "date" as column label
holidays1["date"]=holidays1['day']
holidays1.head()

In [ ]:
#dropped unneeded columns
holiday_unoff=holidays1.drop(columns=["day","type"])
holiday_unoff.head()

In [ ]:
#renamed "event" to "holiday"
holiday_unoff.rename(columns={"event":"holiday"}, inplace=True)
holiday_unoff.head()

In [ ]:
create dataframe for only 2011
df_sales1=df_sales[df_sales["Date"].dt.year==2011]

In [ ]:
#dropped large holiday boolean
df_sales1=df_sales1.drop(columns=["IsHoliday"])

In [ ]:
#renamed date column 
holiday_unoff=holiday_unoff.rename(columns={'date':'Date'})

In [ ]:
#merged holiday and sales table using a left innerjoin on 'Date'
sales_unoff_holi=df_sales1.merge(holiday_unoff,on="Date",how="left")
sales_unoff_holi

In [ ]:
#renamed column 
sales_unoff_holi=sales_unoff_holi.rename(columns={'Holiday':'unnoficial_holiday'})
sales_unoff_holi.head()

### Stores DataFrame

In [25]:
# Create a dataframe
df_stores = pd.read_csv(stores_data_set)
df_stores.head()

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

# Load Data

In [26]:
# connect to local database
engine = create_engine(f'postgresql://postgres:jmballer29@localhost:5432/project_2_db')
# check for tables (validating connection is made)
engine.table_names()

ModuleNotFoundError: No module named 'psycopg2'

In [ ]:
# load dataframe into database
games_teams_df.to_sql(name="games",con=engine,if_exists='append',index=False)

In [ ]:
# confirm it was loaded by querying games table
pd.read_sql_query('select * from games',con=engine).head()